// task 1

console.log('// Задание 1. Дан массив с элементами [1, 2, 3, 4, 5]. С помощью цикла for выведите все эти элементы на экран.');

let arr_a = [1, 2, 3, 4, 5];

for (let i = 0; i < arr_a.length; i++) {

    console.log(arr_a[i]);

}


// task 2

console.log('// Задание 2. Дан массив с числами [-2, -1, -3, 15, 0, -4, 2, -5, 9, -15, 0, 4, 5, -6, 10, 7]. Числа могут быть положительными и отрицательными. Выведите на экран только отрицательные числа, которые больше -10, но меньше -3.');

let arr_b = [-2, -1, -3, 15, 0, -4, 2, -5, 9, -15, 0, 4, 5, -6, 10, 7];

for (i = 0; i < arr_b.length; i++) {

    if (arr_b[i] > -10 && arr_b[i] < -3 ) console.log(arr_b[i]);

}


// task 3

console.log('// Задание 3. Создайте новый массив и заполните его значениями от 23 до 57, используя цикл for и while. Выведите оба массива. С помощью цикла for найдите сумму элементов этого массива. Запишите ее в переменную result и выведите.');

let arr_c = [];

for (i = 23; i <= 57; i++) {

    arr_c[arr_c.length] = i; 

}

console.log('Массив, созданный с помощью for:');
console.log(arr_c);

let j = 23
    arr_d = [];

while (j <= 57) {

    arr_d.push(j);

    j++;

}

console.log('Массив, созданный с помощью while:');
console.log(arr_d);

let sum_d = 0;

for (i = 0; i < arr_d.length; i++) {

    sum_d += arr_d[i];

}

console.log('Сумма чисел элементов массива - ' + sum_d);

// task 4

console.log('// Задание 4. Дан массив числами (строчного типа), например: [‘10’, ‘20’, ‘30’, ‘50’, ‘235’, ‘3000’]. Выведите на экран только те числа из массива, которые начинаются на цифру 1, 2 или 5.');

let arr_e = ['10', '20', '30', '50', '235', '3000'],
    arr_enum = [];

for (i = 0; i < arr_e.length; i++) {

    arr_enum = arr_e[i].split('');

    if (arr_enum[0] == '1' || arr_enum[0] == '2' || arr_enum[0] == '5') console.log(arr_e[i]);

}


// task 5

document.write('<p>// Задание 5. Составьте массив дней недели (ПН, ВТ, СР и т.д.). С помощью цикла for выведите все дни недели, а выходные дни выведите жирным:</p>');

let arr_f = ['ПН', 'ВТ', 'СР', 'ЧТ', 'ПТ', 'СБ', 'ВС'];

for (i = 0; i < arr_f.length; i++) {

    if (i <= 4) {

        document.write(arr_f[i] + ' ');
        
    } else {

        document.write('<strong>' + arr_f[i] + '</strong> ');

    }

}


// task 6

console.log('// Задание 6. Создайте массив с произвольными данными. Добавьте в конец массива любой элемент, и получите последний элемент массива, используя свойство length.');

console.log('Дан массив:');

let arr_r = ['Два', 'раза', 'в', 'неделю', 'я', 'хожу', 'на', 'курсы'];

console.log(arr_r);

console.log('Добавим в массив элемент "Back-end"');
arr_r.push('Back-end');

console.log('Массив теперь выглядит так:');
console.log(arr_r);
console.log('Последний элемент массива - ' + arr_r[arr_r.length - 1]);


// task 7

console.log('// Задание 7. Запросите у пользователя по очереди числовые значения при помощи prompt и сохраните их в массив. Собирайте числа до тех пор, пока пользователь не введет пустое значение. Выведите получившийся массив на экран. Выполните сортировку чисел массива, и выведите его на экран.');

let s,
    arr_s = [];

while (s != '') {

    s = prompt('7. Введите любое число (выход из цикла - пустое значение)');

    if (s == null) break;

    if (isNaN(s)) {

        if (s == '') break;

        alert('Вы ввели не число, попробуйте еще раз!');

    } else {

        if (s != '') arr_s.push(s);
        
    }

}

if (arr_s.length == 0) {

    console.log('Вы не ввели ни одного числа и вышли из цикла. Массив пустой')

} else {

    console.log('Полученный массив:');
    console.log(arr_s);

    arr_s.sort(function(a, b) {
        return a - b;
    });

    if (arr_s.length < 2) {

        console.log('Тут нечего сортировать, вы ввели всего одно число');

    } else {

        console.log('Сортируем массив по возрастанию:');
        console.log(arr_s);

    }

}


// task 8 

console.log('// Задание 8. Переверните массив [12, false, ‘Текст’, 4, 2, 5, 0] (выведите в обратном порядке), используя цикл while и метод reverse.');

let arr_t = [12, false, 'Текст', 4, 2, 5, 0],
    arr_trevers = [];

console.log('С помощью цикла while:');

i = arr_t.length - 1;

while (i >= 0) {

    arr_trevers.push(arr_t[i]);

    i--;

}

console.log(arr_trevers);

console.log('С помощью метода revers:');
console.log(arr_t.reverse());


// task 9

console.log('// Задание 9. Напишите скрипт, считающий количество нулевых (пустых) элементов в заданном целочисленном массиве [5, 9, 21, , , 9, 78, , , , 6]');

let arr_u = [5, 9, 21,,, 9, 78,,,, 6],
    u_count = 0;

for (i = 0; i < arr_u.length; i++) {

    if (arr_u[i] == null) {
        u_count++;
    }

}

console.log(arr_u);
console.log('Кол-во нулевых элементов = ' + u_count);


// task 10

console.log('// Задание 10. Найдите сумму элементов массива между двумя нулями (первым и последним нулями в массиве). Если двух нулей нет в массиве, то выведите ноль. В массиве может быть более 2х нулей. Пример массива: [48,9,0,4,21,2,1,0,8,84,76,8,4,13,2] или [1,8,0,13,76,8,7,0,22,0,2,3,2].')

let x,
    sum_x = 0,
    arr_x = [48, 9, 0, 4, 0, 21, 2, 0, 1, 8, 84, 76, 8, 4, 13, 2];

console.log('Исходный массив:');
console.log(arr_x);

i = arr_x.indexOf(0);
j = arr_x.lastIndexOf(0);

if (i == -1 || i == j) {

    console.log('В массиве нет двух нулей')

} else {

    while (i < arr_x.lastIndexOf(0)) {

        sum_x += arr_x[i];

        i++;

    }

    console.log('Сумма всех элементов в массиве между нулями - ' + sum_x);
    
}


// task 11

console.log('// Задание 11. Нарисовать равнобедренный треугольник из символов ^. Высоту выбирает пользователь.');

let z = prompt('Введите высоту треугольника: целое число > 0');

if (isNaN(z) || z == '' || z <= 1) {
        
    alert('Вы ввели неправильно число');

} else {

    let space_z,
        cap_z;

    j = 0;

    while (j < z) {

        space_z = '';
        cap_z = '';

        for (i = 0; i < z - j; i++) {

            space_z += ' ';

        }
    
        for (i = 0; i < (2 * j + 1); i++) {

            cap_z += '^';

        }
        
        console.log(space_z + cap_z);

        j++;

    }
    
}